bufan-zb/BCM/LTC6820_STM32/HARDWARE/LTC6804/LTC6804-1.c
  for( i = 0; i < rx_len; i++)
  {
    rx_data[i] = (uint8_t)SPI1_ReadWriteByte(0x00);
  }

}

/*自测试模式 */
void LTC6804_cvst()
{

  uint8_t cmd[4];
  uint16_t cmd_pec;

  //1
  cmd[0] = 0x02;
  cmd[1] = 0xa7;

  //2
  cmd_pec = pec15_calc(2, cmd);
  cmd[2] = (uint8_t)(cmd_pec >> 8);
  cmd[3] = (uint8_t)(cmd_pec);

  //3
  wakeup_idle (); //This will guarantee that the LTC6804 isoSPI port is awake. This command can be removed.
   wakeup_idle ();
  //4
  LTC6804_CS_low;
  spi_write_array(4,cmd);
  LTC6804_CS_high;

}

void LTC6804_ADSTAT()//启动状态组ADC转换，滤波模式
{

  uint8_t cmd[4];
  uint16_t cmd_pec;

  //1
  cmd[0] = 0x05;
  cmd[1] = 0xE8;

  //2
  cmd_pec = pec15_calc(2, cmd);
  cmd[2] = (uint8_t)(cmd_pec >> 8);
  cmd[3] = (uint8_t)(cmd_pec);

  //3
  wakeup_idle (); //This will guarantee that the LTC6804 isoSPI port is awake. This command can be removed.
  wakeup_idle ();
  //4
  LTC6804_CS_low;
  spi_write_array(4,cmd);
  LTC6804_CS_high;

}

/*读状态寄存器*/
int8_t LTC6804_rdstat(uint8_t reg, //Determines which GPIO voltage register is read back.
					 uint8_t total_ic,//the number of ICs in the system
					 uint16_t stat_codes[][6]//A two dimensional array of the gpio voltage codes.
					 )
{


  const uint8_t NUM_RX_BYT = 8;
  const uint8_t BYT_IN_REG = 6;
  const uint8_t GPIO_IN_REG = 3;

	uint8_t gpio_reg;
	uint8_t current_ic;
	uint8_t current_gpio;
	
  uint8_t data[30];
  uint8_t data_counter = 0;
  int8_t pec_error = 0;
  uint16_t parsed_aux;
  uint16_t received_pec;
  uint16_t data_pec;
 // data = (uint8_t *) malloc((NUM_RX_BYT*total_ic)*sizeof(uint8_t));
  //1.a
  if (reg == 0)
  {
	//a.i
    for( gpio_reg = 1; gpio_reg<3; gpio_reg++)		 	   		 			//executes once for each of the LTC6804 aux voltage registers
    {
      data_counter = 0;
      LTC6804_rdstat_reg(gpio_reg, total_ic,data);									//Reads the raw auxiliary register data into the data[] array

      for ( current_ic = 0 ; current_ic < total_ic; current_ic++) 			// executes for every LTC6804 in the daisy chain
      {																 	  			// current_ic is used as the IC counter

        //a.ii
		for( current_gpio = 0; current_gpio< GPIO_IN_REG; current_gpio++)	// This loop parses the read back data into GPIO voltages, it
        {														   		  			// loops once for each of the 3 gpio voltage codes in the register

		  parsed_aux = data[data_counter] + (data[data_counter+1]<<8);              //Each gpio codes is received as two bytes and is combined to
																				    // create the parsed gpio voltage code

          stat_codes[current_ic][current_gpio +((gpio_reg-1)*GPIO_IN_REG)] = parsed_aux;
          data_counter=data_counter+2;												//Because gpio voltage codes are two bytes the data counter
																					//must increment by two for each parsed gpio voltage code

        }
		//a.iii
        received_pec = (data[data_counter]<<8)+ data[data_counter+1]; 				 //The received PEC for the current_ic is transmitted as the 7th and 8th
																				     //after the 6 gpio voltage data bytes
        data_pec = pec15_calc(BYT_IN_REG, &data[current_ic*NUM_RX_BYT]);
        if(received_pec != data_pec)
        {
          pec_error = -1;															//The pec_error variable is simply set negative if any PEC errors
																					//are detected in the received serial data
        }

        data_counter=data_counter+2;												//Because the transmitted PEC code is 2 bytes long the data_counter
																					//must be incremented by 2 bytes to point to the next ICs gpio voltage data
      }


    }

  }
  else
  {
	//b.i
    LTC6804_rdstat_reg(reg, total_ic, data);
    for ( current_ic = 0 ; current_ic < total_ic; current_ic++) 			  		// executes for every LTC6804 in the daisy chain
    {							   									          		// current_ic is used as an IC counter

		//b.ii
		for( current_gpio = 0; current_gpio<GPIO_IN_REG; current_gpio++)  	 	// This loop parses the read back data. Loops
		{						 											  		// once for each aux voltage in the register

			parsed_aux = (data[data_counter] + (data[data_counter+1]<<8));    		//Each gpio codes is received as two bytes and is combined to
																					// create the parsed gpio voltage code
			stat_codes[current_ic][current_gpio +((reg-1)*GPIO_IN_REG)] = parsed_aux;
			data_counter=data_counter+2;									 		//Because gpio voltage codes are two bytes the data counter
																					//must increment by two for each parsed gpio voltage code
		}
		//b.iii
		received_pec = (data[data_counter]<<8) + data[data_counter+1]; 				 //The received PEC for the current_ic is transmitted as the 7th and 8th
																				     //after the 6 gpio voltage data bytes
        data_pec = pec15_calc(BYT_IN_REG, &data[current_ic*NUM_RX_BYT]);
        if(received_pec != data_pec)
        {
          pec_error = -1;													   		//The pec_error variable is simply set negative if any PEC errors
																					//are detected in the received serial data
        }

		data_counter=data_counter+2;												//Because the transmitted PEC code is 2 bytes long the data_counter
																					//must be incremented by 2 bytes to point to the next ICs gpio voltage data
	}
  }
 // free(data);
  return (pec_error);
}


void LTC6804_rdstat_reg(uint8_t reg, //Determines which GPIO voltage register is read back
					   uint8_t total_ic, //The number of ICs in the system
					   uint8_t *data //Array of the unparsed auxiliary codes
					   )
{
  const uint8_t REG_LEN = 8; // number of bytes in the register + 2 bytes for the PEC
  uint8_t cmd[4];
  uint16_t cmd_pec;

  //1
  if (reg == 1)			//Read back auxiliary group A
  {
    cmd[1] = 0x10;
    cmd[0] = 0x00;
  }
  else if(reg == 2)		//Read back auxiliary group B
  {
    cmd[1] = 0x12;
    cmd[0] = 0x00;
  }
  else					//Read back auxiliary group A
  {
     cmd[1] = 0x10;
     cmd[0] = 0x00;
  }
  //2
  cmd_pec = pec15_calc(2, cmd);
  cmd[2] = (uint8_t)(cmd_pec >> 8);
  cmd[3] = (uint8_t)(cmd_pec);

  //3
  wakeup_idle ();
  wakeup_idle (); //This will guarantee that the LTC6804 isoSPI port is awake, this command can be removed.
  //4
  LTC6804_CS_low;
  spi_write_read(cmd,4,data,(REG_LEN*total_ic));
  LTC6804_CS_high;

}

void LTC6804_adcvax()//启动组合电池电压以及GPIO1、GPIO2转换和轮询状态
{
		uint8_t cmd[4];
		uint16_t cmd_pec;

		//1
		cmd[0] = 0x05;//滤波模式，一个转换要270ms
		//cmd[1] = 0x6F;// MD[1：0]=01:27KHz快速   10:7KHz标准  11:26Hz滤波模式
    cmd[1] = 0xeF;
		//2
		cmd_pec = pec15_calc(2, cmd);
		cmd[2] = (uint8_t)(cmd_pec >> 8);
		cmd[3] = (uint8_t)(cmd_pec);

		//3
		wakeup_idle ();//This will guarantee that the LTC6804 isoSPI port is awake. 
		wakeup_idle ();//This command can be removed.
		wakeup_idle ();//5句wakeup_idle ()可保证LTC6804 isoSP 接口唤醒。
		wakeup_idle ();
		wakeup_idle ();
		//4
	  //以下指令详见LTC6804-1说明书P53页,与“起动电池电压ADC转换”说明类似
		LTC6804_CS_low;  //把CSB信号拉低  
		spi_write_array(4,cmd);//发送命令
		LTC6804_CS_high; //把CSB信号拉高

}
